zephyrproject-rtos/zephyr/drivers/audio/dmic_stm32_dfsdm.c
/*
 * SPDX-FileCopyrightText: Copyright (c) 2026 STMicroelectronics
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/sys/util_macro.h>
#include <zephyr/arch/common/ffs.h>
#include <zephyr/audio/dmic.h>
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/devicetree/dma.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/logging/log.h>
#include <zephyr/pm/device.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/sys/util.h>
#include <zephyr/cache.h>
#include <soc.h>

#include <stdint.h>
#include <string.h>

#define DT_DRV_COMPAT st_stm32_dfsdm

#define DFSDM_MAX_FILTERS  4
#define DFSDM_MAX_CHANNELS 8

/* Oversampling max values */
#define DFSDM_MAX_INT_OVERSAMPLING 256
#define DFSDM_MAX_FL_OVERSAMPLING  1024

/* Limit filter output resolution to 31 bits. (i.e. sample range is +/-2^30) */
#define DFSDM_DATA_MAX BIT(30)

/* Prescaler clock divider limits */
#define DFSDM_CLKDIV_MIN 2
#define DFSDM_CLKDIV_MAX 256

/*
 * Data are output as two's complement data in a 24 bit field.
 * Data from filters are in the range +/-2^(n-1)
 * 2^(n-1) maximum positive value cannot be coded in 2's complement n bits
 * An extra bit is required to avoid wrap-around of the binary code for 2^(n-1)
 * So, the resolution of samples from filter is actually limited to 23 bits
 */
#define DFSDM_DATA_RES 24

LOG_MODULE_REGISTER(st_stm32_dfsdm, CONFIG_AUDIO_DMIC_LOG_LEVEL);

struct dmic_stm32_dfsdm_filter_osr {
	uint16_t iosr;    /* Integrator oversampling */
	uint16_t fosr;    /* Filter oversampling */
	uint8_t rshift;   /* Output sample right shift (hardware shift) */
	int8_t pcm_shift; /* PCM scaling shift after the hardware shift */
	uint64_t res;     /* Output sample resolution */
};

struct dmic_stm32_dfsdm_filter_data {
	volatile enum dmic_state state;
	DFSDM_Channel_HandleTypeDef *hchannels; /* Active hardware channels */
	DFSDM_Filter_HandleTypeDef hfilter;
	struct dmic_stm32_dfsdm_filter_osr osr[2]; /* 0: regular, 1: fast conversion mode */
	struct k_mem_slab *mem_slab;
	void *buffer;
	uint16_t buf_pos;
	struct k_msgq *rx_queue;
	uint8_t num_channels; /* Number of active channels */
	uint32_t chan_map;    /* Requested channel map by user */
	uint16_t block_size;
	uint8_t sincorder;
	uint8_t pcm_width;
	int8_t pcm_shift; /* PCM scaling shift for the active filter output */
	int32_t *dma_buffer;
	uint32_t dma_half_block_size_in_bytes;
	struct dma_block_config dma_block;
	int32_t *dma_buffer_ptr[2];
	int32_t *dma_current_buffer;
};

struct dmic_stm32_dfsdm_filter_cfg {
	void (*irq_config_func)(const struct device *dev);
	const struct pinctrl_dev_config *pcfg;
	const struct device *parent;
	uint8_t hw_channel;
	const struct device *dma_dev;
	uint32_t dma_channel;
	uint32_t dma_slot;
};

struct dmic_stm32_dfsdm_cfg {
	const struct stm32_pclken pclken; /* Peripheral clock */
	const struct stm32_pclken aclken; /* Audio clock */
	const struct reset_dt_spec reset;
};

/* Each filter has its own ISR */
static void dmic_stm32_dfsdm_isr(const struct device *dev)
{
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;

	HAL_DFSDM_IRQHandler(&data->hfilter);
}

void HAL_DFSDM_FilterErrorCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
	struct dmic_stm32_dfsdm_filter_data *data =
		CONTAINER_OF(hdfsdm_filter, struct dmic_stm32_dfsdm_filter_data, hfilter);

	switch (HAL_DFSDM_FilterGetError(hdfsdm_filter)) {
	case DFSDM_FILTER_ERROR_NONE:
		LOG_WRN("No error");
		break;
	case DFSDM_FILTER_ERROR_REGULAR_OVERRUN:
		LOG_WRN("Regular conversion overrun error");
		break;
	case DFSDM_FILTER_ERROR_INJECTED_OVERRUN:
		LOG_WRN("Injected conversion overrun error");
		break;
	case DFSDM_FILTER_ERROR_DMA:
		LOG_WRN("DMA error");
		break;
	default:
		LOG_ERR("Unknown error");
	}

	data->state = DMIC_STATE_ERROR;
}

static void dmic_stm32_dfsdm_write_sample(uint8_t *dst, uint8_t sample_size, int32_t sample)
{
	switch (sample_size) {
	case 1:
		*dst = (uint8_t)CLAMP(sample, INT8_MIN, INT8_MAX);
		break;
	case 2:
		sys_put_le16((uint16_t)CLAMP(sample, INT16_MIN, INT16_MAX), dst);
		break;
	case 3:
		sys_put_le24((uint32_t)CLAMP(sample, -BIT(23), BIT(23) - 1), dst);
		break;
	default:
		break;
	}
}

void HAL_DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
	struct dmic_stm32_dfsdm_filter_data *data =
		CONTAINER_OF(hdfsdm_filter, struct dmic_stm32_dfsdm_filter_data, hfilter);
	uint32_t chan;
	int32_t sample;
	uint8_t sample_size;
	int ret;

	/* REOCF is only cleared on DFSDM_FLTxRDATAR read.
	 * Read sample before checking error to prevent irq deadlock.
	 */
	sample = HAL_DFSDM_FilterGetRegularValue(hdfsdm_filter, &chan);

	if (data->buffer == NULL || data->state == DMIC_STATE_ERROR) {
		return;
	}

	sample_size = DIV_ROUND_UP(data->pcm_width, BITS_PER_BYTE);

	if (data->pcm_shift > 0) {
		sample >>= data->pcm_shift;
	} else if (data->pcm_shift < 0) {
		sample <<= -data->pcm_shift;
	} else {
		/* Already in the correct format, no need to shift */
	}

	/* Write sample into current buffer */
	if (data->buf_pos + sample_size <= data->block_size) {
		dmic_stm32_dfsdm_write_sample((uint8_t *)data->buffer + data->buf_pos, sample_size,
					      sample);
		data->buf_pos += sample_size;
	}

	/* Push full buffer to the queue and allocate a new one */
	if (data->buf_pos >= data->block_size) {
		void *full_buf = data->buffer;

		ret = k_msgq_put(data->rx_queue, &full_buf, K_NO_WAIT);
		if (ret < 0) {
			LOG_ERR("RX queue overflow, dropping full buffer: %d", ret);
			k_mem_slab_free(data->mem_slab, full_buf);
		}

		ret = k_mem_slab_alloc(data->mem_slab, &data->buffer, K_NO_WAIT);
		if (ret < 0) {
			LOG_ERR("Could not allocate next RX buffer: %d", ret);
			data->buffer = NULL;
			data->state = DMIC_STATE_ERROR;
			return;
		}
		data->buf_pos = 0;
	}
}

/* DFSDM channels in HAL are defined as follows:
 * - in 16-bit LSB the channel mask is set
 * - in 16-bit MSB the channel number is set
 * e.g. for channel 5 definition:
 *   0x00000020 | 0x00050000 = 0x00050020
 */
static uint32_t hw_chan_from_index(uint8_t idx)
{
	return ((uint32_t)idx << 16) | BIT(idx);
}

/* Determine optimal values for FOSR and IOSR to maximize data output resolution.
 *
 * FOSR - Filter OverSampling Ratio (decimation factor in the Sincx/FastSinc filter)
 * IOSR - Integrator OverSampling Ratio (sum of data for a given number of samples from the filter)
 */
static int dmic_stm32_dfsdm_compute_osrs(struct dmic_stm32_dfsdm_filter_osr *osr, uint32_t ford,
					 uint8_t fast_mode, unsigned int oversamp,
					 uint8_t pcm_width)
{
	uint32_t fosr, iosr;
	uint64_t res;
	uint8_t p = ford;
	uint8_t m = 1;
	int shift = 0;
	int bits = 0;

