zephyrproject-rtos/zephyr/drivers/audio/dmic_stm32_dfsdm.c
	if (osr == NULL) {
		return -EINVAL;
	}

	memset(osr, 0, sizeof(*osr));

	if (ford == DFSDM_FILTER_FASTSINC_ORDER) {
		m = 2;
		p = 2;
	}

	for (fosr = 1; fosr <= DFSDM_MAX_FL_OVERSAMPLING; fosr++) {
		for (iosr = 1; iosr <= DFSDM_MAX_INT_OVERSAMPLING; iosr++) {
			uint32_t dec;

			/* Fast conversion mode changes the decimation rate algorithm */
			if (fast_mode != 0) {
				dec = fosr * iosr;
			} else if (ford == DFSDM_FILTER_FASTSINC_ORDER) {
				dec = fosr * (iosr + 3) + 2;
			} else {
				dec = fosr * (iosr - 1 + p) + p;
			}

			if (dec > oversamp) {
				break;
			} else if (dec != oversamp) {
				continue;
			}

			/* Compute resolution */
			res = m;
			for (int i = 0; i < p; i++) {
				res *= fosr;
				if (res > DFSDM_DATA_MAX) {
					break;
				}
			}
			if (res > DFSDM_DATA_MAX) {
				continue;
			}

			res *= iosr;
			if (res > DFSDM_DATA_MAX) {
				continue;
			}

			if (res >= osr->res) {
				osr->res = res;
				osr->fosr = fosr;
				osr->iosr = iosr;

				bits = find_msb_set(osr->res);

				if (osr->res > BIT(bits - 1)) {
					bits++;
				}

				shift = DFSDM_DATA_RES - bits;
				/* Compute right shift */
				if (shift > 0) {
					/* Resolution is lower than 24 bits */
					osr->rshift = 0;
					osr->pcm_shift = (int8_t)bits - (int8_t)pcm_width;
				} else {
					osr->rshift = 1 - shift;
					osr->pcm_shift = DFSDM_DATA_RES - pcm_width - 1;
				}
			}
		}
	}

	LOG_DBG("fast_mode %d, fosr %d, iosr %d, res 0x%llx/%d bits, rshift %d, pcm_shift %d",
		fast_mode, osr->fosr, osr->iosr, osr->res, bits, osr->rshift, osr->pcm_shift);
	if (!osr->res) {
		return -EINVAL;
	}

	return 0;
}

static int dmic_stm32_dfsdm_get_all_osrs(const struct device *dev, unsigned int oversamp,
					 uint8_t pcm_width)
{
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;
	int ret = 0;

	memset(&data->osr[0], 0, sizeof(data->osr[0]));
	memset(&data->osr[1], 0, sizeof(data->osr[1]));

	/* Compute OSR for regular conversion mode */
	ret = dmic_stm32_dfsdm_compute_osrs(&data->osr[0], data->sincorder, 0, oversamp, pcm_width);
	if (ret < 0) {
		LOG_ERR("Filter parameters not found for regular conversion: %d", ret);
		return -EINVAL;
	}

	/* Compute OSR for fast conversion mode */
	ret = dmic_stm32_dfsdm_compute_osrs(&data->osr[1], data->sincorder, 1, oversamp, pcm_width);
	if (ret < 0) {
		LOG_ERR("Filter parameters not found for fast mode conversion: %d", ret);
		return -EINVAL;
	}

	return 0;
}

/* Reclaim completed buffers still queued for the consumer */
static void dmic_stm32_dfsdm_purge_rx_queue(struct dmic_stm32_dfsdm_filter_data *data)
{
	void *buffer;

	while (k_msgq_get(data->rx_queue, &buffer, K_NO_WAIT) == 0) {
		k_mem_slab_free(data->mem_slab, buffer);
	}
}

static int dmic_stm32_dfsdm_stop(const struct device *dev)
{
	const struct dmic_stm32_dfsdm_filter_cfg *drv_cfg = dev->config;
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;
	HAL_StatusTypeDef hal_ret;

	/* DMA VERSION */
	if (drv_cfg->dma_dev != NULL) {
		hal_ret = HAL_DFSDM_FilterRegularStop(&data->hfilter);
		dma_stop(drv_cfg->dma_dev, drv_cfg->dma_channel);
	} else {
		hal_ret = HAL_DFSDM_FilterRegularStop_IT(&data->hfilter);
	}

	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to stop DFSDM in regular mode");
		return -EIO;
	}

	hal_ret = HAL_DFSDM_FilterDeInit(&(data->hfilter));
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to stop filter %s", dev->name);
		return -EIO;
	}

	/* Stop channel */
	hal_ret = HAL_DFSDM_ChannelDeInit(data->hchannels);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to stop channel");
		return -EIO;
	}

	/* Conversions and their IRQs are stopped: release the in-flight buffer
	 * the driver still owns so it is not leaked across a stop/start cycle.
	 */
	if (data->buffer != NULL) {
		k_mem_slab_free(data->mem_slab, data->buffer);
		data->buffer = NULL;
	}

	return 0;
}

static void dmic_stm32_dfsdm_dma_callback(const struct device *dma_dev, void *user_data,
					  uint32_t channel, int status)
{
	const struct device *dev = user_data;
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;
	void *slab_buf;
	int ret;

	if (status != DMA_STATUS_BLOCK && status != DMA_STATUS_COMPLETE) {
		LOG_ERR("DMA Error occurred");
		return;
	}

	/* Protect Cache: Invalidate the specific half-buffer so the CPU sees new RAM data */
	sys_cache_data_invd_range(data->dma_current_buffer, data->dma_half_block_size_in_bytes);

	/* Grab a clean block from the user's mem_slab */
	ret = k_mem_slab_alloc(data->mem_slab, &slab_buf, K_NO_WAIT);
	if (ret < 0) {
		LOG_ERR("Audio slab empty, dropping frame!");
		return;
	}

	/* Shift and pack the data */
	uint32_t num_samples = data->dma_half_block_size_in_bytes / sizeof(int32_t);

	if (data->pcm_width == 16) {
		int16_t *dst = (int16_t *)slab_buf;

		for (uint32_t i = 0; i < num_samples; i++) {
			/* Shift right by 16 to extract the MSB 16-bits of the audio */
			dst[i] = (int16_t)(data->dma_current_buffer[i] >> 16);
		}
	} else {
		int32_t *dst = (int32_t *)slab_buf;

		for (uint32_t i = 0; i < num_samples; i++) {
			/* Shift right by 8 to extract the 24-bit audio and sign-extend */
			dst[i] = (data->dma_current_buffer[i] >> 8);
		}
	}

	if (data->dma_current_buffer == data->dma_buffer_ptr[0]) {
		data->dma_current_buffer = data->dma_buffer_ptr[1];
	} else {
		data->dma_current_buffer = data->dma_buffer_ptr[0];
	}

	/* Push completed block to the app queue */
	ret = k_msgq_put(data->rx_queue, &slab_buf, K_NO_WAIT);
	if (ret < 0) {
		k_mem_slab_free(data->mem_slab, slab_buf);
		LOG_ERR("RX queue full, dropped frame");
	}
}

static int dmic_stm32_dfsdm_start(const struct device *dev)
{
	const struct dmic_stm32_dfsdm_filter_cfg *drv_cfg = dev->config;
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;
	HAL_StatusTypeDef hal_ret;
	int ret;

	/* Reclaim any buffers left queued by a previous (stopped) capture so a
	 * fresh start always begins with the full mem_slab available.
	 */
	dmic_stm32_dfsdm_purge_rx_queue(data);

	/* DMA VERSION */
	if (drv_cfg->dma_dev != NULL) {
		data->dma_block.block_size = data->dma_half_block_size_in_bytes * 2;
		data->dma_block.source_address = (uint32_t)&data->hfilter.Instance->FLTRDATAR;
		data->dma_block.dest_address = (uint32_t)data->dma_buffer;
		data->dma_block.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		data->dma_block.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		data->dma_block.source_reload_en = 1;
		data->dma_block.dest_reload_en = 1;
		data->dma_block.next_block = NULL;

		struct dma_config dma_cfg = {
			.channel_direction = PERIPHERAL_TO_MEMORY,
			.source_data_size = 4,
			.dest_data_size = 4,
			.source_burst_length = 4,
			.dest_burst_length = 4,
			.block_count = 1,
			.dma_slot = drv_cfg->dma_slot,
			.head_block = &data->dma_block,
			.dma_callback = dmic_stm32_dfsdm_dma_callback,
			.user_data = (void *)dev,
			.cyclic = 1,
			.half_complete_callback_en = 1,
		};

		ret = dma_config(drv_cfg->dma_dev, drv_cfg->dma_channel, &dma_cfg);
		if (ret < 0) {
			LOG_ERR("Failed to configure DMA: %d", ret);
			return ret;
		}

		ret = dma_start(drv_cfg->dma_dev, drv_cfg->dma_channel);
		if (ret < 0) {
			LOG_ERR("Failed to start DMA: %d", ret);
			return ret;
		}

		/* RDMAEN is already set, just trigger the basic software start */
		hal_ret = HAL_DFSDM_FilterRegularStart(&data->hfilter);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to start DFSDM filter");
			return -EIO;
		}
	} else {
		ret = k_mem_slab_alloc(data->mem_slab, &data->buffer, K_NO_WAIT);
		if (ret < 0) {
			LOG_ERR("Could not allocate RX buffer. Dropping RX data: %d", ret);
			data->state = DMIC_STATE_ERROR;
			return ret;
		}
		data->buf_pos = 0;

