zephyrproject-rtos/zephyr/drivers/audio/dmic_stm32_dfsdm.c
		/* Start DFSDM conversions */
		hal_ret = HAL_DFSDM_FilterRegularStart_IT(&data->hfilter);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to start DFSDM filter %s in irq mode", dev->name);
			k_mem_slab_free(data->mem_slab, data->buffer);
			data->buffer = NULL;
			return -EIO;
		}
	}
	data->state = DMIC_STATE_ACTIVE;

	return 0;
}

static int dmic_stm32_dfsdm_filter_deinit(const struct device *dev)
{
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;
	int ret = 0;

	if (data->state == DMIC_STATE_ACTIVE) {
		ret = dmic_stm32_dfsdm_stop(dev);
	}

	if (data->buffer != NULL) {
		k_mem_slab_free(data->mem_slab, data->buffer);
		data->buffer = NULL;
	}

	/* Drop any completed buffers the consumer never read */
	dmic_stm32_dfsdm_purge_rx_queue(data);

	data->state = DMIC_STATE_UNINIT;

	return ret;
}

static int dmic_stm32_dfsdm_trigger(const struct device *dev, enum dmic_trigger cmd)
{
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;
	int ret;

	switch (cmd) {
	case DMIC_TRIGGER_PAUSE:
	case DMIC_TRIGGER_STOP:
		if (data->state == DMIC_STATE_ACTIVE) {
			ret = dmic_stm32_dfsdm_stop(dev);
			if (ret < 0) {
				return ret;
			}
		}
		data->state = DMIC_STATE_CONFIGURED;
		break;
	case DMIC_TRIGGER_START:
		if (data->state != DMIC_STATE_CONFIGURED) {
			return -EIO;
		}

		ret = dmic_stm32_dfsdm_start(dev);
		if (ret < 0) {
			LOG_ERR("Could not start DMIC");
			return ret;
		}
		break;
	case DMIC_TRIGGER_RELEASE:
	case DMIC_TRIGGER_RESET:
		ret = dmic_stm32_dfsdm_filter_deinit(dev);
		if (ret < 0) {
			LOG_ERR("Could not deinit DMIC");
			return ret;
		}
		break;
	default:
		return -ENOTSUP;
	}

	return 0;
}

static int dmic_stm32_dfsdm_read(const struct device *dev, uint8_t stream, void **buffer,
				 size_t *size, int32_t timeout)
{
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;
	int ret;

	ARG_UNUSED(stream);

	/* Check if we are in a state that can read */
	if ((data->state != DMIC_STATE_CONFIGURED) && (data->state != DMIC_STATE_ACTIVE) &&
	    (data->state != DMIC_STATE_PAUSED)) {
		LOG_ERR("Device state is not valid for read");
		return -EIO;
	}

	ret = k_msgq_get(data->rx_queue, buffer, SYS_TIMEOUT_MS(timeout));
	if (ret < 0) {
		return ret;
	}
	*size = data->block_size;

	return 0;
}

static int dmic_stm32_dfsdm_setup_channel(const struct device *dev, uint32_t div, uint8_t chan,
					  enum pdm_lr lr)
{
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;
	DFSDM_Channel_HandleTypeDef *hchannel = data->hchannels;
	DFSDM_Filter_HandleTypeDef *hfilter = &data->hfilter;
	uint8_t fast_mode = 0;

	if (hfilter->Init.RegularParam.FastMode == ENABLE) {
		fast_mode = 1;
	}

	data->pcm_shift = data->osr[fast_mode].pcm_shift;
	hchannel->Init.RightBitShift = data->osr[fast_mode].rshift;
	hchannel->Init.OutputClock.Divider = div;
	hchannel->Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;

	if (lr == PDM_CHAN_RIGHT) {
		hchannel->Init.Input.Pins = DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS;
		hchannel->Init.SerialInterface.Type = DFSDM_CHANNEL_SPI_FALLING;
	} else {
		hchannel->Init.Input.Pins = DFSDM_CHANNEL_SAME_CHANNEL_PINS;
		hchannel->Init.SerialInterface.Type = DFSDM_CHANNEL_SPI_RISING;
	}

	if (HAL_DFSDM_ChannelInit(hchannel) != HAL_OK) {
		LOG_ERR("Failed to init channel %d", chan);
		return -EIO;
	}

	return 0;
}

static int dmic_stm32_dfsdm_setup_filter(const struct device *dev, uint8_t chan)
{
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;
	DFSDM_Filter_HandleTypeDef *hfilter = &data->hfilter;
	HAL_StatusTypeDef hal_ret;
	uint8_t fast_mode = 0;

	if (hfilter->Init.RegularParam.FastMode == ENABLE) {
		fast_mode = 1;
	}

	hfilter->Init.FilterParam.IntOversampling = data->osr[fast_mode].iosr;
	hfilter->Init.FilterParam.Oversampling = data->osr[fast_mode].fosr;

	/* SincOrder is used as is in HAL for register value */
	hfilter->Init.FilterParam.SincOrder = data->sincorder << DFSDM_FLTFCR_FORD_Pos;

	hal_ret = HAL_DFSDM_FilterInit(hfilter);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to init filter");
		return -EIO;
	}

	/* Configure regular channel, with continuous conversion for now */
	hal_ret = HAL_DFSDM_FilterConfigRegChannel(hfilter, hw_chan_from_index(chan),
						   DFSDM_CONTINUOUS_CONV_ON);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to configure regular channel");
		return -EIO;
	}

	return 0;
}

static int dmic_stm32_dfsdm_filter_init(const struct device *dev)
{
	const struct dmic_stm32_dfsdm_filter_cfg *cfg = dev->config;
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;
	int ret;

	/* Configure DT provided pins */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("Could not configure pinctrl: %d", ret);
		return ret;
	}

	/* Connect filter interrupts */
	cfg->irq_config_func(dev);

	data->state = DMIC_STATE_INITIALIZED;

	return 0;
}

static int dmic_stm32_dfsdm_configure(const struct device *dev, struct dmic_cfg *cfg)
{
	const struct dmic_stm32_dfsdm_filter_cfg *drv_cfg = dev->config;
	const struct dmic_stm32_dfsdm_cfg *parent_cfg = drv_cfg->parent->config;
	struct dmic_stm32_dfsdm_filter_data *data = dev->data;

	struct pcm_stream_cfg *stream = &cfg->streams[0];
	struct pdm_chan_cfg *channel = &cfg->channel;
	uint32_t bitclk_rate, oversamp;
	uint32_t max, min = 1;
	uint8_t hw_chan = drv_cfg->hw_channel;
	uint8_t pdm_idx;
	enum pdm_lr lr = 0;
	HAL_StatusTypeDef hal_ret;
	uint32_t requested_samples = stream->block_size / (stream->pcm_width / 8);
	int ret = 0;

	if (data->state == DMIC_STATE_ACTIVE) {
		return -EBUSY;
	}

	/* Only one active stream is supported */
	if (channel->req_num_streams != 1) {
		return -EINVAL;
	}

	/* DMA buffer must be bigger enough to fit user request block size */
	if (drv_cfg->dma_dev != NULL &&
	    requested_samples > CONFIG_DMIC_STM32_DFSDM_MAX_SAMPLES) {
		LOG_ERR("Requested %u samples, max allowed is %d. "
			"Increase CONFIG_DMIC_STM32_DFSDM_MAX_SAMPLES in Kconfig.",
			requested_samples, CONFIG_DMIC_STM32_DFSDM_MAX_SAMPLES);
		return -EINVAL;
	}

	/* DMIC supports up to 8 active channels.
	 * But in regular mode (only supported right now), only 1 channel
	 * per filter can exist.  Verify user is not requesting more.
	 */
	if (channel->req_num_chan > DFSDM_MAX_CHANNELS || channel->req_chan_map_hi != 0) {
		LOG_ERR("DMIC only supports 8 channels or less");
		return -ENOTSUP;
	}

	if (stream->pcm_rate == 0 || stream->pcm_width == 0) {
		if (data->state == DMIC_STATE_CONFIGURED) {
			ret = dmic_stm32_dfsdm_filter_deinit(dev);
		}
		return ret;
	}

	if (stream->pcm_width > DFSDM_DATA_RES) {
		LOG_ERR("DMIC only supports max 24-bit resolution samples");
		return -ENOTSUP;
	}

	/* If DMIC was deinitialized, reinit here */
	if (data->state == DMIC_STATE_UNINIT) {
		ret = dmic_stm32_dfsdm_filter_init(dev);
		if (ret < 0) {
			LOG_ERR("Could not reinit DMIC: %d", ret);
			return ret;
		}
	}

	/* Tear down a previous configuration before reprogramming the channel */
	if (data->state == DMIC_STATE_CONFIGURED) {
		if (HAL_DFSDM_ChannelGetState(data->hchannels) != HAL_DFSDM_CHANNEL_STATE_RESET) {
			hal_ret = HAL_DFSDM_ChannelDeInit(data->hchannels);
			if (hal_ret != HAL_OK) {
				LOG_ERR("Failed to deinit channel before reconfiguring");
				return -EIO;
			}
		}

		if (HAL_DFSDM_FilterGetState(&data->hfilter) != HAL_DFSDM_FILTER_STATE_RESET) {
			hal_ret = HAL_DFSDM_FilterDeInit(&data->hfilter);
			if (hal_ret != HAL_OK) {
				LOG_ERR("Failed to deinit filter before reconfiguring");
				return -EIO;
			}
		}
	}

	/* Get Audio clock */
	ret = clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				     (clock_control_subsys_t)&parent_cfg->aclken, &bitclk_rate);
	if (ret < 0) {
		return ret;
	}

	/* Clamp prescaler values to hardware limits */
	min = MAX(DFSDM_CLKDIV_MIN, DIV_ROUND_UP(bitclk_rate, cfg->io.max_pdm_clk_freq));
	max = MIN(DFSDM_CLKDIV_MAX, bitclk_rate / cfg->io.min_pdm_clk_freq);

