zephyrproject-rtos/zephyr/drivers/audio/dmic_stm32_dfsdm.c
	/* No valid prescaler exists */
	if (min > max) {
		return -EINVAL;
	}

	/* All values are valid within [min, max] range
	 * Take the min to get the fastest clock possible
	 */
	bitclk_rate /= min;
	LOG_INF("bitclk_rate %d Hz, div %d, output clock %d Hz", bitclk_rate * min, min,
		bitclk_rate);

	oversamp = DIV_ROUND_CLOSEST(bitclk_rate, stream->pcm_rate);
	ret = dmic_stm32_dfsdm_get_all_osrs(dev, oversamp, stream->pcm_width);
	if (ret < 0) {
		return ret;
	}

	/* Validate requested L/R pairs before applying hardware limits */
	for (uint8_t chan = 0; chan < channel->req_num_chan; chan += 2) {
		enum pdm_lr lr_0, lr_1;
		uint8_t hw_chan_0, hw_chan_1;

		dmic_parse_channel_map(channel->req_chan_map_lo, channel->req_chan_map_hi, chan,
				       &hw_chan_0, &lr_0);
		if ((chan + 1) < channel->req_num_chan) {
			dmic_parse_channel_map(channel->req_chan_map_lo, channel->req_chan_map_hi,
					       chan + 1, &hw_chan_1, &lr_1);
			if ((lr_0 == lr_1) || (hw_chan_0 != hw_chan_1)) {
				return -EINVAL;
			}
		}
	}

	dmic_parse_channel_map(channel->req_chan_map_lo, 0, 0, &pdm_idx, &lr);

	/* Regular mode supports one DFSDM channel per filter */
	channel->act_num_chan = 1;
	channel->act_chan_map_lo = dmic_build_channel_map(0, pdm_idx, lr);
	channel->act_chan_map_hi = 0;
	data->chan_map = channel->act_chan_map_lo;

	/* DFSDM channel initialization */
	ret = dmic_stm32_dfsdm_setup_channel(dev, min, hw_chan, lr);
	if (ret < 0) {
		return ret;
	}

	if (drv_cfg->dma_dev != NULL) {
		/* Calculate internal DMA half-transfer size in bytes
		 * (DFSDM DMA always outputs 32-bit words, so sizeof(int32_t))
		 */
		data->dma_half_block_size_in_bytes = requested_samples * sizeof(int32_t);
		data->dma_buffer_ptr[0] = data->dma_buffer;
		data->dma_buffer_ptr[1] = data->dma_buffer + requested_samples;
		data->dma_current_buffer = data->dma_buffer_ptr[0];
		/* Update the HAL init structure BEFORE HAL_DFSDM_FilterInit is called */
		data->hfilter.Init.RegularParam.DmaMode = ENABLE;

		LOG_DBG("DMA Configured: %u samples requested. Internal half-buffer = %u bytes.",
			requested_samples, data->dma_half_block_size_in_bytes);
	} else {
		data->hfilter.Init.RegularParam.DmaMode = DISABLE;
	}

	/* DFSDM filter initialization */
	ret = dmic_stm32_dfsdm_setup_filter(dev, hw_chan);
	if (ret < 0) {
		return ret;
	}

	data->mem_slab = stream->mem_slab;
	data->block_size = stream->block_size;
	data->pcm_width = stream->pcm_width;
	data->num_channels = channel->act_num_chan;
	data->state = DMIC_STATE_CONFIGURED;

	return 0;
}

static DEVICE_API(dmic, dmic_stm32_dfsdm_ops) = {
	.configure = dmic_stm32_dfsdm_configure,
	.trigger = dmic_stm32_dfsdm_trigger,
	.read = dmic_stm32_dfsdm_read,
};

static int dmic_stm32_dfsdm_init(const struct device *dev)
{
	const struct dmic_stm32_dfsdm_cfg *cfg = dev->config;
	int ret;

	LOG_DBG("Initializing %s", dev->name);

	/* Turn on DFSDM peripheral clock */
	ret = clock_control_on(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
			       (clock_control_subsys_t)&cfg->pclken);
	if (ret < 0) {
		LOG_ERR("Could not enable peripheral clock: %d", ret);
		return ret;
	}

	ret = clock_control_configure(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				      (clock_control_subsys_t)&cfg->aclken, NULL);
	if (ret < 0) {
		LOG_ERR("Could not configure aclk: %d", ret);
		return ret;
	}

	/* Reset DFSDM */
	if (!device_is_ready(cfg->reset.dev)) {
		LOG_ERR("Reset controller not ready");
		return -ENODEV;
	}
	reset_line_toggle_dt(&cfg->reset);

	return 0;
}

#ifdef CONFIG_PM_DEVICE
static int dmic_stm32_dfsdm_deinit(const struct device *dev)
{
	const struct dmic_stm32_dfsdm_cfg *cfg = dev->config;
	int ret = 0;

	reset_line_toggle_dt(&cfg->reset);

	/* Turn off DFSDM peripheral clock */
	ret = clock_control_off(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				(clock_control_subsys_t)&cfg->pclken);
	if (ret < 0) {
		LOG_ERR("Could not disable peripheral clock: %d", ret);
	}

	return ret;
}

static int dmic_stm32_dfsdm_pm_action(const struct device *dev, enum pm_device_action action)
{
	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		return dmic_stm32_dfsdm_init(dev);
	case PM_DEVICE_ACTION_SUSPEND:
		return dmic_stm32_dfsdm_deinit(dev);
	default:
		return -ENOTSUP;
	}
}
#endif /* CONFIG_PM_DEVICE */

#define DMIC_DFSDM_CHAN_IDX(chan) DT_PROP(chan, reg)
/* Evaluates to NULL/0 when DMA is NOT present in the devicetree */

#define DFSDM_DMA_DEV(id)                                                      \
	COND_CODE_1(DT_NODE_HAS_PROP(id, dmas),                                \
	(DEVICE_DT_GET(DT_DMAS_CTLR_BY_NAME(id, rx))), (NULL))

#define DFSDM_DMA_CHAN(id)                                                     \
	DT_DMAS_CELL_BY_NAME_OR(id, rx, channel, 0)

#define DFSDM_DMA_SLOT(id)                                                     \
	DT_DMAS_CELL_BY_NAME_OR(id, rx, slot, 0)

#define DMIC_DFSDM_CHAN_REG_ADDR(chan)                                                             \
	(DFSDM_Channel_TypeDef *)(DT_REG_ADDR(DT_GPARENT(chan)) + DMIC_DFSDM_CHAN_IDX(chan) * 0x20)

#define DMIC_DFSDM_CHAN_DEFINE(chan)                                                               \
	{                                                                                          \
		.Instance = DMIC_DFSDM_CHAN_REG_ADDR(chan),                                        \
		.Init =                                                                            \
			{                                                                          \
				.Awd =                                                             \
					{                                                          \
						.FilterOrder = DFSDM_CHANNEL_FASTSINC_ORDER,       \
						.Oversampling = 1,                                 \
					},                                                         \
				.Input =                                                           \
					{                                                          \
						.DataPacking = DFSDM_CHANNEL_STANDARD_MODE,        \
						.Multiplexer = DFSDM_CHANNEL_EXTERNAL_INPUTS,      \
					},                                                         \
				.Offset = 0,                                                       \
				.OutputClock =                                                     \
					{                                                          \
						.Activation = ENABLE,                              \
						.Selection = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO,     \
					},                                                         \
				.SerialInterface =                                                 \
					{                                                          \
						.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL,      \
						.Type = DFSDM_CHANNEL_SPI_RISING,                  \
					},                                                         \
			},                                                                         \
	},

#define DMIC_DFSDM_FLT_REG_ADDR(flt)                                                               \
	(DFSDM_Filter_TypeDef *)(DT_REG_ADDR(DT_PARENT(flt)) + DT_REG_ADDR(flt) * 0x80 + 0x100)

