zephyrproject-rtos/zephyr/drivers/audio/dmic_stm32_dfsdm.c
/*
 * Filters can only have one enabled channel child. The build assert in
 * DMIC_DFSDM_FILTERS_DEFINE() keeps this FOREACH expansion to a single value.
 */
#define DMIC_DFSDM_HW_CHANNEL(flt) DT_FOREACH_CHILD_STATUS_OKAY_SEP(flt, DMIC_DFSDM_CHAN_IDX, ())

#define DMIC_DFSDM_FILTER_HFILTER(flt)                                                             \
	{                                                                                          \
		.Instance = DMIC_DFSDM_FLT_REG_ADDR(flt),                                          \
		.Init =                                                                            \
			{                                                                          \
				.InjectedParam =                                                   \
					{                                                          \
						.DmaMode = DISABLE,                                \
						.ExtTrigger = DFSDM_FILTER_EXT_TRIG_TIM8_TRGO,     \
						.ExtTriggerEdge =                                  \
							DFSDM_FILTER_EXT_TRIG_BOTH_EDGES,          \
						.ScanMode = DISABLE,                               \
						.Trigger = DT_PROP(flt, filter0_sync),             \
					},                                                         \
				.RegularParam =                                                    \
					{                                                          \
						.DmaMode = DISABLE,                                \
						.FastMode = ENABLE,                                \
						.Trigger = DFSDM_FILTER_SW_TRIGGER,                \
					},                                                         \
			},                                                                         \
	}

#define DMIC_DFSDM_FILTERS_DEFINE(flt)                                                             \
	BUILD_ASSERT(DT_CHILD_NUM_STATUS_OKAY(flt) == 1,                                           \
		     "One DFSDM channel child per filter (regular mode)");                         \
                                                                                                   \
	PINCTRL_DT_DEFINE(flt);                                                                    \
                                                                                                   \
	K_MSGQ_DEFINE_STATIC_TYPE(dmic_stm32_dfsdm_msgq_##flt, void *,                             \
				  CONFIG_AUDIO_DMIC_STM32_QUEUE_SIZE);                             \
                                                                                                   \
	IF_ENABLED(DT_NODE_HAS_PROP(flt, dmas),                                                    \
		(static int32_t __aligned(32)                                                      \
		dma_buf_##flt[CONFIG_DMIC_STM32_DFSDM_MAX_SAMPLES * 2];))                          \
		                                                                                   \
	static DFSDM_Channel_HandleTypeDef hchannels_##flt[] = {                                   \
		DT_FOREACH_CHILD(flt, DMIC_DFSDM_CHAN_DEFINE)};                                    \
                                                                                                   \
	static void dmic_stm32_dfsdm_irq_cfg_func_##flt(const struct device *dev)                  \
	{                                                                                          \
		IRQ_CONNECT(DT_IRQN(flt), DT_IRQ(flt, priority), dmic_stm32_dfsdm_isr,             \
			    DEVICE_DT_GET(flt), 0);                                                \
		irq_enable(DT_IRQN(flt));                                                          \
	}                                                                                          \
                                                                                                   \
	static const struct dmic_stm32_dfsdm_filter_cfg dmic_stm32_dfsdm_filter_##flt = {          \
		.irq_config_func = dmic_stm32_dfsdm_irq_cfg_func_##flt,                            \
		.pcfg = PINCTRL_DT_DEV_CONFIG_GET(flt),                                            \
		.parent = DEVICE_DT_GET(DT_PARENT(flt)),                                           \
		.hw_channel = DMIC_DFSDM_HW_CHANNEL(flt),                                          \
		/* Conditionally compile the DMA spec based on Devicetree */                       \
		.dma_dev = DFSDM_DMA_DEV(flt),                                                     \
		.dma_channel = DFSDM_DMA_CHAN(flt),                                                \
		.dma_slot = DFSDM_DMA_SLOT(flt),                                                   \
	};                                                                                         \
                                                                                                   \
	static struct dmic_stm32_dfsdm_filter_data dmic_stm32_dfsdm_filter_data_##flt = {          \
		.hchannels = hchannels_##flt,                                                      \
		.hfilter = DMIC_DFSDM_FILTER_HFILTER(flt),                                         \
		.sincorder = DT_PROP(flt, filter_order),                                           \
		.rx_queue = &dmic_stm32_dfsdm_msgq_##flt,                                          \
		.dma_buffer = COND_CODE_1(DT_NODE_HAS_PROP(flt, dmas),                             \
					  (dma_buf_##flt), (NULL)),                                \
	};                                                                                         \
                                                                                                   \
	DEVICE_DT_DEFINE(flt, dmic_stm32_dfsdm_filter_init, NULL,                                  \
			 &dmic_stm32_dfsdm_filter_data_##flt, &dmic_stm32_dfsdm_filter_##flt,      \
			 POST_KERNEL, CONFIG_AUDIO_DMIC_INIT_PRIORITY, &dmic_stm32_dfsdm_ops);

#define DFSDM_DEFINE(n)                                                                            \
	PM_DEVICE_DT_INST_DEFINE(n, dmic_stm32_dfsdm_pm_action);                                   \
                                                                                                   \
	static const struct dmic_stm32_dfsdm_cfg dmic_stm32_dfsdm_cfg_##n = {                      \
		.pclken = STM32_DT_INST_CLOCK_INFO_BY_NAME(n, pclk),                               \
		.aclken = STM32_DT_INST_CLOCK_INFO_BY_NAME(n, aclk),                               \
		.reset = RESET_DT_SPEC_INST_GET(n),                                                \
	};                                                                                         \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(n, dmic_stm32_dfsdm_init, NULL, NULL, &dmic_stm32_dfsdm_cfg_##n,     \
			      POST_KERNEL, CONFIG_AUDIO_DMIC_INIT_PRIORITY, NULL);                 \
	DT_INST_FOREACH_CHILD_STATUS_OKAY(n, DMIC_DFSDM_FILTERS_DEFINE)

DT_INST_FOREACH_STATUS_OKAY(DFSDM_DEFINE)
